src/Catalogs/Салоны/Салоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Салоны</name>
  <predefined>
    <items>
      <name>ГаммаВелюр</name>
      <description>Гамма велюр</description>
    </items>
  </predefined>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логотип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>РабочийДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Салоны/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Если Параметры.Ключ.Пустая() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.РежимРаботы.Количество() = 0 Тогда
		ЗаполнитьДниНеделиСЧасами();
	КонецЕсли;
	
КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьДниНеделиСЧасами()

	ОбъектМетаданных = Метаданные.Перечисления.ДниНедели;
	
	Для каждого ЗначениеПеречисления Из ОбъектМетаданных.ЗначенияПеречисления Цикл
		СтрокаТЧ = Объект.РежимРаботы.Добавить();
		СтрокаТЧ.ДеньНедели = Перечисления.ДниНедели[ЗначениеПеречисления.Имя];
		СтрокаТЧ.ВремяНачала = '000101010900';	
		СтрокаТЧ.ВремяОкончания = '000101011900';	
	КонецЦикла;


КонецПроцедуры // ЗаполнитьДниНеделиСЧасами()
